<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>Name</key>
            <string>Cloudflare DNS with Malware Blocker over HTTPS</string>
            <key>PayloadDescription</key>
            <string>Configures device to use Cloudflare DNS with Malware Blocker over HTTPS.</string>
            <key>PayloadDisplayName</key>
            <string>Cloudflare DNS with Malware Blocker(HTTPS)</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.dnsSettings.managed.fa127112-9c2c-460c-9a2a-24e9f4620f15</string>
            <key>PayloadType</key>
            <string>com.apple.dnsSettings.managed</string>
            <key>PayloadUUID</key>
            <string>fa127112-9c2c-460c-9a2a-24e9f4620f15</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>DNSSettings</key>
            <dict>
                <key>DNSProtocol</key>
                <string>HTTPS</string>
                <key>ServerAddresses</key>
                    <array>
                        <string>2606:4700:4700::1112</string>
                        <string>2606:4700:4700::1002</string>
                        <string>1.1.1.2</string>
                        <string>1.0.0.2</string>
                    </array>
                <key>ServerURL</key>
                <string>https://security.cloudflare-dns.com/dns-query</string>
            </dict>
        </dict>
    </array>
    <key>PayloadDescription</key>
    <string>Adds Cloudflare DNS with Malware Blocker to macOS 11 Big Sur and iOS 14 or newer systems.</string>
    <key>PayloadDisplayName</key>
    <string>Cloudflare DNS with Malware Blocker(HTTPS)</string>
    <key>PayloadIdentifier</key>
    <string>f2719a80-968d-4d1c-ba31-208581f54943</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>6fe0e4d8-36b3-4e60-8b14-35ce1dcae5a7</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
